export class TestMessagesMock {
  static timeViewed = '2022-11-02 09:58:28';
  static json = `
  {
        "id": 12,
        "messages": [
            {
                "id": 1,
                "pid": 0,
                "tid": 0,
                "n": "Вася",
                "t": "111",
                "a": 0,
                "i": "84",
                "cm": "1",
                "d": "111"
            },
            {
                "id": 2,
                "pid": 1,
                "tid": 1,
                "n": "Хоркина",
                "t": "222",
                "a": 0,
                "i": "0",
                "cm": "0",
                "d": "222",
                "star": 0
            },
            {
                "id": 3,
                "pid": 2,
                "tid": 1,
                "n": "Кабаева",
                "t": "333",
                "a": 0,
                "i": "424",
                "cm": "0",
                "d": "333",
                "star": 0
            },
            {
                "id": 4,
                "pid": 3,
                "tid": 1,
                "n": "Бабаева",
                "t": "444",
                "a": 0,
                "i": "468",
                "cm": "0",
                "d": "444",
                "star": 1
            }
        ]
    }


  `;

}
